In [3]:
import pandas as pd
import sqlite3

# Load Titanic dataset
url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
df = pd.read_csv(url)

# Create SQLite DB in memory
conn = sqlite3.connect(":memory:")
df.to_sql("titanic", conn, index=False, if_exists="replace")

891

In [4]:
# 1. Show first 5 passengers
print(pd.read_sql("SELECT * FROM titanic LIMIT 5", conn))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500  None        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250  None        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500  None        S

In [5]:
# 2. Count how many passengers survived
print(pd.read_sql("SELECT survived, COUNT(*) as count FROM titanic GROUP BY survived", conn))

   Survived  count
0         0    549
1         1    342

In [6]:
# 3. Average age by class
print(pd.read_sql("SELECT pclass, AVG(age) as avg_age FROM titanic GROUP BY pclass", conn))

   Pclass    avg_age
0       1  38.233441
1       2  29.877630
2       3  25.140620

In [7]:
# 4. Number of survivors by gender
print(pd.read_sql("""
    SELECT sex, COUNT(*) as survivors
    FROM titanic
    WHERE survived = 1
    GROUP BY sex
""", conn))

      Sex  survivors
0  female        233
1    male        109

In [8]:
# 5. Top 5 oldest passengers who survived
print(pd.read_sql("""
    SELECT name, age
    FROM titanic
    WHERE survived = 1 AND age IS NOT NULL
    ORDER BY age DESC
    LIMIT 5
""", conn))

                                        Name   Age
0       Barkworth, Mr. Algernon Henry Wilson  80.0
1          Andrews, Miss. Kornelia Theodosia  63.0
2                     Turkula, Mrs. (Hedwig)  63.0
3                         Harris, Mr. George  62.0
4  Stone, Mrs. George Nelson (Martha Evelyn)  62.0